notes-server/soap-examples/update.txt

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
  <soap:Body>
    <m:UpdateNote xmlns:m="https://notes-server/soap/v1">
    <m:Id>123</m:Id>
    <m:Content>Test note</m:Content>
    </m:UpdateNote>
  </soap:Body>
</soap:Envelope>